import React, { useState, useEffect, useContext } from 'react';
import { useNavigate, NavLink } from 'react-router-dom';

const Home = ({ setUserData }) => {

   
    return (
<>
<h1>תפארת חן</h1>
<h2>אודות תפארת חן</h2>
<h3>
לפני כ-20 שנה הקימה וייסדה הגברת ציפי ישי את סטודיו 'תפארת - חן' סטודיו יוקרתי ומפנק ליום הכי מיוחד בחייה של כל כלה! 
בסטודיו תפארת חן מבחר גדול ומגוון של שמלות כלה עשויות תחרה יוקרתית מהקולקציות המעודכנות ביותר ובהשראת מעצבים מובילים מרחבי העולם, תוך התאמה לקהל הדתי מבלי להתפשר על רמת העיצוב.
 עיצוב אישי וייחודי בגזרות מותאמות המחמיאות לך, ושימוש בבדים, תחרות וחומרי גלם משובחים.
תפארת חן הינו סטודיו יוקרתי לשמלות כלה שאינו מתפשר על יחס אישי לכל כלה רמת עיצוב גבוהה . בסטודיו שלנו הממוקם בשכונת הר נוף בירושלים, מבחר עשיר, גדול, עדכני וצנוע של שמלות כלה המעוצבות ברמה יוקרתית ובמחירים סבירים.

אנו מזמינים אותך לבוא ביום המאושר בחייך לסלון הכלות היוקרתי שלנו לאירוע מושלם ביום הגדול בחייה של כל כלה.

הכתובת שלנו רחוב קצנלבוגן 30 שכונת הר נוף ירושלים. 
מספר הטלפון : 026513648 , 0507454200

 מחכות לך באהבה, צוות תפארת חן</h3>
</>
    
    );
}

export default Home
